// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   OpeninfoStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell openinfo command
// 
// Revision History:
// 
// --*/ 

/=#

#langdef   eng "English"

#string STR_SHELLENV_DPROT_IMAGE_2							#language eng  "%HImage%N("

#string STR_SHELLENV_DPROT_IMAGE							#language eng  "%HImage%N(%s) " 

#string STR_SHELLENV_PROTID_ONE_VAR_HS_NEWLINE				#language eng  "%hs \n"

#string STR_SHELLENV_PROTID_NHANDLE							#language eng  "%NHandle %h02x (%hX)\n"

#string STR_SHELLENV_PROTID_DRV_CTRL_CNT					#language eng  "  Drv[%h02x] Ctrl[  ] Cnt(%h02x) "

#string STR_SHELLENV_PROTID_DRV_CTRL_CNT_2					#language eng  "  Drv[%h02x] Ctrl[%h02x] Cnt(%h02x) "

#string STR_SHELLENV_PROTID_ONE_VAR_HS_NO_SPACES			#language eng  "%hs"

#string STR_SHELLENV_PROTID_OPENINFO_HANDLE_OUT_OF_RANGE	#language eng  "%hs: Handle %h02x out of range\n"

#string STR_HELPINFO_OPENINFO_SYNTAX			#language eng   "OPENINFO Handle [-b]\n"

#string STR_HELPINFO_OPENINFO_LINEHELP		#language eng   "Displays the protocols and agents associated with a handle"

#string STR_HELPINFO_OPENINFO_VERBOSEHELP	#language eng   "Displays the protocols and agents associated with a handle.\n"
                                                          "\n"
                                                          "OPENINFO Handle [-b]\n"
                                                          "\n"
                                                          "    -b       - Display one screen at a time\n"
                                                          "    Handle   - Display open protocol information for specified handle\n"
                                                          "\n"
                                                          "Examples:\n"
                                                          "  * To show open protocols on handle 0x23:\n"
                                                          "    It shows that the PCI Root Bridge is being managed by the PCI\n"
                                                          "    Bus Driver, and the PCI Bus contains 7 PCI child controllers.\n"
                                                          "    Shell> openinfo 23\n"
                                                          "    Handle 23 (07DEE108)\n"
                                                          "    PciRootBridgeIo\n"
                                                          "      Drv[1D] Ctrl[23] Cnt(01) Driver   Image(PciBus)\n"
                                                          "      Drv[1D] Ctrl[28] Cnt(01) Child    Image(PciBus)\n"
                                                          "      Drv[1D] Ctrl[29] Cnt(01) Child    Image(PciBus)\n"
                                                          "      Drv[1D] Ctrl[2A] Cnt(01) Child    Image(PciBus)\n"
                                                          "      Drv[1D] Ctrl[2B] Cnt(01) Child    Image(PciBus)\n"
                                                          "      Drv[1D] Ctrl[2C] Cnt(01) Child    Image(PciBus)\n"
                                                          "      Drv[1D] Ctrl[2D] Cnt(01) Child    Image(PciBus)\n"
                                                          "      Drv[1D] Ctrl[2E] Cnt(01) Child    Image(PciBus)\n"
                                                          "      Drv[00] Ctrl[  ] Cnt(01) HandProt\n"
                                                          "    dpath\n"
                                                          "      Drv[1D] Ctrl[23] Cnt(01) Driver   Image(PciBus)\n"
                                                          "      Drv[00] Ctrl[  ] Cnt(0D) HandProt\n"
